java/modules/core/src/test/resources/org/apache/synapse/mediators/builtin/synapse-501-soap.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
<SOAP-ENV:Body>
<ns6216:issue xmlns:ns6216="http://hostname/rfid_1_0/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<nu4900:token xmlns:nu4900="http://hostname/rfid_1_0/" xsi:type="xsd:string">00000000-00</nu4900:token>
<nu4712:rfid xmlns:nu4712="http://hostname/rfid_1_0/" xsi:type="xsd:string">4C46688D</nu4712:rfid>
<nu9698:eventId xmlns:nu9698="http://hostname/rfid_1_0/" xsi:type="xsd:string">0</nu9698:eventId>
<nu5118:locationId xmlns:nu5118="http://hostname/rfid_1_0/" xsi:type="xsd:long">534</nu5118:locationId>
<nu4242:accessStart xmlns:nu4242="http://hostname/rfid_1_0/" xsi:type="xsd:string">test0.8</nu4242:accessStart>
</ns6216:issue>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
